MrBlinky/Arduboy-homemade-package/board-package-source/boards.txt
# Board definitions for Arduboy production v1.0, DevkKit and homemade versions
# using Leonardo, Micro and (Sparkfun) Pro Micro boards.

menu.based_on=Based on
menu.core=Core
menu.display=Display
menu.contrast=Display contrast
menu.boot=Bootloader
menu.flashselect=Flash select
menu.rtc=RealTimeClock

################################################################################
# Arduboy homemade board
################################################################################

arduboy-homemade.name=Homemade Arduboy

#Arduino Leonardo
arduboy-homemade.vid.0=0x2341
arduboy-homemade.pid.0=0x0036
arduboy-homemade.vid.1=0x2341
arduboy-homemade.pid.1=0x8036
arduboy-homemade.vid.2=0x2A03
arduboy-homemade.pid.2=0x0036
arduboy-homemade.vid.3=0x2A03
arduboy-homemade.pid.3=0x8036
#Arduino Micro
arduboy-homemade.vid.4=0x2341
arduboy-homemade.pid.4=0x0037
arduboy-homemade.vid.5=0x2341
arduboy-homemade.pid.5=0x8037
arduboy-homemade.vid.6=0x2A03
arduboy-homemade.pid.6=0x0037
arduboy-homemade.vid.7=0x2A03
arduboy-homemade.pid.7=0x8037
#Genuino Micro
arduboy-homemade.vid.8=0x2341
arduboy-homemade.pid.8=0x8237
#Sparkfun Pro Micro 5V
arduboy-homemade.vid.7=0x1b4f
arduboy-homemade.pid.7=0x9205
arduboy-homemade.vid.8=0x1b4f
arduboy-homemade.pid.8=0x9206

arduboy-homemade.upload.tool=arduino:avrdude
arduboy-homemade.upload.protocol=avr109
arduboy-homemade.upload.maximum_size=28672
arduboy-homemade.upload.maximum_data_size=2560
arduboy-homemade.upload.speed=57600
arduboy-homemade.upload.disable_flushing=true
arduboy-homemade.upload.use_1200bps_touch=true
arduboy-homemade.upload.wait_for_upload_port=true

arduboy-homemade.bootloader.tool=arduino:avrdude
arduboy-homemade.bootloader.low_fuses=0xff
arduboy-homemade.bootloader.high_fuses=0xd0
arduboy-homemade.bootloader.extended_fuses=0xcb
arduboy-homemade.bootloader.unlock_bits=0x3F
arduboy-homemade.bootloader.lock_bits=0x3F

arduboy-homemade.build.mcu=atmega32u4
arduboy-homemade.build.f_cpu=16000000L
arduboy-homemade.build.board=AVR_ARDUBOY_HOMEMADE
arduboy-homemade.build.core=arduino:arduino

## Arduboy homemade based on boards ###########################################

# Leonardo #
arduboy-homemade.menu.based_on.leonardo=Arduino Leonardo
arduboy-homemade.menu.based_on.leonardo.build.board=AVR_LEONARDO
arduboy-homemade.menu.based_on.leonardo.build.vid=0x2341
arduboy-homemade.menu.based_on.leonardo.build.pid=0x8036
arduboy-homemade.menu.based_on.leonardo.build.variant=arduboy-leonardo
arduboy-homemade.menu.based_on.leonardo.build.usb_product="ABL{usb_product_postfix}"
arduboy-homemade.menu.based_on.leonardo.org_bootloader_file=caterina/Caterina-Leonardo.hex
arduboy-homemade.menu.based_on.leonardo.c3k_bootloader_file=cathy3k/arduboy3k-bootloader-menu{bootloader_display}{bootloader_flashselect}.hex
arduboy-homemade.menu.based_on.leonardo.c3kg_bootloader_file=cathy3k/arduboy3k-bootloader-game{bootloader_display}{bootloader_flashselect}.hex

# micro #
arduboy-homemade.menu.based_on.micro=Arduino/Genuino Micro
arduboy-homemade.menu.based_on.micro.build.board=AVR_MICRO
arduboy-homemade.menu.based_on.micro.build.vid=0x2341
arduboy-homemade.menu.based_on.micro.build.pid=0x8037
arduboy-homemade.menu.based_on.micro.build.variant=arduboy-micro
arduboy-homemade.menu.based_on.micro.build.usb_product="ABM{usb_product_postfix}"
arduboy-homemade.menu.based_on.micro.org_bootloader_file=caterina/Caterina-Micro.hex
arduboy-homemade.menu.based_on.micro.c3k_bootloader_file=cathy3k/arduboy3k-bootloader-menu-micro{bootloader_display}{bootloader_flashselect}.hex
arduboy-homemade.menu.based_on.micro.c3kg_bootloader_file=cathy3k/arduboy3k-bootloader-game-micro{bootloader_display}{bootloader_flashselect}.hex

# (SparkFun) Pro Micro 5V #
arduboy-homemade.menu.based_on.promicro=Pro Micro 5V - Standard wiring
#arduboy-homemade.menu.based_on.promicro.build.vid=0x1b4f
#arduboy-homemade.menu.based_on.promicro.build.pid=0x9206
#using Leonardo vid,pid for driver simplicity
arduboy-homemade.menu.based_on.promicro.build.vid=0x2341
arduboy-homemade.menu.based_on.promicro.build.pid=0x8036
arduboy-homemade.menu.based_on.promicro.build.variant=arduboy-promicro
arduboy-homemade.menu.based_on.promicro.build.usb_product="ABP{usb_product_postfix}"
arduboy-homemade.menu.based_on.promicro.build.board=AVR_PROMICRO
arduboy-homemade.menu.based_on.promicro.org_bootloader_file=caterina/Caterina-promicro16.hex
arduboy-homemade.menu.based_on.promicro.c3k_bootloader_file=cathy3k/arduboy3k-bootloader-menu{bootloader_display}{bootloader_flashselect}.hex
arduboy-homemade.menu.based_on.promicro.c3kg_bootloader_file=cathy3k/arduboy3k-bootloader-game{bootloader_display}{bootloader_flashselect}.hex

arduboy-homemade.menu.based_on.promicro_alt=Pro Micro 5V - Alternate wiring
#arduboy-homemade.menu.based_on.promicro_alt.build.vid=0x1b4f
#arduboy-homemade.menu.based_on.promicro_alt.build.pid=0x9206
#using Leonardo vid,pid for driver simplicity
arduboy-homemade.menu.based_on.promicro_alt.build.vid=0x2341
arduboy-homemade.menu.based_on.promicro_alt.build.pid=0x8036
arduboy-homemade.menu.based_on.promicro_alt.build.variant=arduboy-promicro-alt
arduboy-homemade.menu.based_on.promicro_alt.build.usb_product="ABA{usb_product_postfix}"
arduboy-homemade.menu.based_on.promicro_alt.build.board=AVR_PROMICRO -DAB_ALTERNATE_WIRING
arduboy-homemade.menu.based_on.promicro_alt.org_bootloader_file=caterina/Caterina-promicro16.hex
arduboy-homemade.menu.based_on.promicro_alt.c3k_bootloader_file=cathy3k/arduboy3k-bootloader-menu-promicro{bootloader_display}{bootloader_flashselect}.hex
arduboy-homemade.menu.based_on.promicro_alt.c3kg_bootloader_file=cathy3k/arduboy3k-bootloader-game-promicro{bootloader_display}{bootloader_flashselect}.hex

# bootloader #
arduboy-homemade.menu.boot.org=original (Caterina)
arduboy-homemade.menu.boot.org.upload.maximum_size=28672
arduboy-homemade.menu.boot.org.bootloader.high_fuses=0xd0
arduboy-homemade.menu.boot.org.bootloader.file={org_bootloader_file}

arduboy-homemade.menu.boot.cathy3k=Cathy3K (starts with menu)
arduboy-homemade.menu.boot.cathy3k.upload.maximum_size=29696
arduboy-homemade.menu.boot.cathy3k.bootloader.high_fuses=0xd2
arduboy-homemade.menu.boot.cathy3k.bootloader.file={c3k_bootloader_file}

arduboy-homemade.menu.boot.cathy3kg=Cathy3K (starts with game)
arduboy-homemade.menu.boot.cathy3kg.upload.maximum_size=29696
arduboy-homemade.menu.boot.cathy3kg.bootloader.high_fuses=0xd2
arduboy-homemade.menu.boot.cathy3kg.bootloader.file={c3kg_bootloader_file}

