MrBlinky/Arduboy-homemade-package/board-package-source/boards.txt
arduboy-fx-devkit.menu.core.arduboy-core=Arduboy optimized core
arduboy-fx-devkit.menu.core.arduboy-core.build.core=arduboy

arduboy-fx-devkit.menu.core.arduino-core=Standard Arduino core
arduboy-fx-devkit.menu.core.arduino-core.build.core=arduino:arduino

arduboy-fx-devkit.menu.boot.cathy3k=Cathy3K (starts with menu)
arduboy-fx-devkit.menu.boot.cathy3k.upload.maximum_size=29696
arduboy-fx-devkit.menu.boot.cathy3k.bootloader.high_fuses=0xd2
arduboy-fx-devkit.menu.boot.cathy3k.bootloader.app=menu.hex

arduboy-fx-devkit.menu.boot.cathy3kg=Cathy3K (starts with game)
arduboy-fx-devkit.menu.boot.cathy3kg.upload.maximum_size=29696
arduboy-fx-devkit.menu.boot.cathy3kg.bootloader.high_fuses=0xd2
arduboy-fx-devkit.menu.boot.cathy3kg.bootloader.app=game.hex

arduboy-fx-devkit.menu.rtc.none=None
arduboy-fx-devkit.menu.rtc.none.bootloader.sub=cathy3k/
arduboy-fx-devkit.menu.rtc.none.bootloader.file=arduboy3k-bootloader-
arduboy-fx-devkit.menu.rtc.ds3231=DS3231
arduboy-fx-devkit.menu.rtc.ds3231.bootloader.sub=cathy3k-rtc/
arduboy-fx-devkit.menu.rtc.ds3231.bootloader.file=arduboy3k-bootloader-ds3231-
arduboy-fx-devkit.menu.rtc.rv3028=RV3028
arduboy-fx-devkit.menu.rtc.rv3028.bootloader.sub=cathy3k-rtc/
arduboy-fx-devkit.menu.rtc.rv3028.bootloader.file=arduboy3k-bootloader-rv3028-

################################################################################
# Arduboy mini board
################################################################################

arduboy-mini.name=Arduboy mini

#Arduino Leonardo
arduboy-mini.vid.0=0x2341
arduboy-mini.pid.0=0x0036
arduboy-mini.vid.1=0x2341
arduboy-mini.pid.1=0x8036
arduboy-mini.vid.2=0x2A03
arduboy-mini.pid.2=0x0036
arduboy-mini.vid.3=0x2A03
arduboy-mini.pid.3=0x8036
#Arduino Micro
arduboy-mini.vid.4=0x2341
arduboy-mini.pid.4=0x0037
arduboy-mini.vid.5=0x2341
arduboy-mini.pid.5=0x8037
arduboy-mini.vid.6=0x2A03
arduboy-mini.pid.6=0x0037
arduboy-mini.vid.7=0x2A03
arduboy-mini.pid.7=0x8037
#Genuino Micro
arduboy-mini.vid.8=0x2341
arduboy-mini.pid.8=0x8237
#Sparkfun Pro Micro 5V
arduboy-mini.vid.8=0x1b4f
arduboy-mini.pid.8=0x9205
arduboy-mini.vid.9=0x1b4f
arduboy-mini.pid.9=0x9206

arduboy-mini.upload.tool=arduino:avrdude
arduboy-mini.upload.protocol=avr109
arduboy-mini.upload.maximum_size=29696
arduboy-mini.upload.maximum_data_size=2560
arduboy-mini.upload.speed=57600
arduboy-mini.upload.disable_flushing=true
arduboy-mini.upload.use_1200bps_touch=true
arduboy-mini.upload.wait_for_upload_port=true

arduboy-mini.bootloader.tool=arduino:avrdude
arduboy-mini.bootloader.low_fuses=0xff
arduboy-mini.bootloader.high_fuses=0xd2
arduboy-mini.bootloader.extended_fuses=0xcb
arduboy-mini.bootloader.sub=cathy3k/
arduboy-mini.bootloader.file=arduboymini-bootloader-
arduboy-mini.bootloader.app=menu.hex
arduboy-mini.bootloader.unlock_bits=0x3F
arduboy-mini.bootloader.lock_bits=0x2F

arduboy-mini.build.mcu=atmega32u4
arduboy-mini.build.f_cpu=16000000L
arduboy-mini.build.variant=arduboy-mini
arduboy-mini.build.board=AVR_ARDUBOY
arduboy-mini.build.vid=0x2341
arduboy-mini.build.pid=0x8036
arduboy-mini.build.usb_manufacturer="Arduboy Inc"
arduboy-mini.build.usb_product="Arduboy"
arduboy-mini.build.board=AVR_ARDUBOY
arduboy-mini.build.core=arduino:arduino
arduboy-mini.build.flash_cs=-DCART_CS_HWB
arduboy-mini.build.extra_flags=-DARDUBOY_10 {build.flash_cs} {build.usb_flags}

# Arduboy mini menu options ######################################################

arduboy-mini.menu.core.arduboy-core=Arduboy optimized core
arduboy-mini.menu.core.arduboy-core.build.core=arduboy

arduboy-mini.menu.core.arduino-core=Standard Arduino core
arduboy-mini.menu.core.arduino-core.build.core=arduino:arduino

arduboy-mini.menu.boot.cathy3k=Cathy3K (starts with menu)
arduboy-mini.menu.boot.cathy3k.upload.maximum_size=29696
arduboy-mini.menu.boot.cathy3k.bootloader.high_fuses=0xd2
arduboy-mini.menu.boot.cathy3k.bootloader.app=menu.hex

arduboy-mini.menu.boot.cathy3kg=Cathy3K (starts with game)
arduboy-mini.menu.boot.cathy3kg.upload.maximum_size=29696
arduboy-mini.menu.boot.cathy3kg.bootloader.high_fuses=0xd2
arduboy-mini.menu.boot.cathy3kg.bootloader.app=game.hex

arduboy-mini.menu.rtc.none=None
arduboy-mini.menu.rtc.none.bootloader.sub=cathy3k/
arduboy-mini.menu.rtc.none.bootloader.file=arduboymini-bootloader-
arduboy-mini.menu.rtc.ds3231=DS3231
arduboy-mini.menu.rtc.ds3231.bootloader.sub=cathy3k-rtc/
arduboy-mini.menu.rtc.ds3231.bootloader.file=arduboymini-bootloader-ds3231-
arduboy-mini.menu.rtc.rv3028=RV3028
arduboy-mini.menu.rtc.rv3028.bootloader.sub=cathy3k-rtc/
arduboy-mini.menu.rtc.rv3028.bootloader.file=arduboymini-bootloader-rv3028-

################################################################################
# Arduboy board
################################################################################

arduboy.name=Arduboy

#Arduino Leonardo
arduboy.vid.0=0x2341
arduboy.pid.0=0x0036
arduboy.vid.1=0x2341
arduboy.pid.1=0x8036
arduboy.vid.2=0x2A03
arduboy.pid.2=0x0036
arduboy.vid.3=0x2A03
arduboy.pid.3=0x8036
#Arduino Micro
arduboy.vid.4=0x2341
arduboy.pid.4=0x0037
arduboy.vid.5=0x2341
arduboy.pid.5=0x8037
arduboy.vid.6=0x2A03
arduboy.pid.6=0x0037
arduboy.vid.7=0x2A03
arduboy.pid.7=0x8037
#Genuino Micro
arduboy.vid.8=0x2341
arduboy.pid.8=0x8237
#Sparkfun Pro Micro 5V
arduboy.vid.8=0x1b4f
arduboy.pid.8=0x9205
arduboy.vid.9=0x1b4f
arduboy.pid.9=0x9206

arduboy.upload.tool=arduino:avrdude
arduboy.upload.protocol=avr109
arduboy.upload.maximum_size=28672
arduboy.upload.maximum_data_size=2560
arduboy.upload.speed=57600
arduboy.upload.disable_flushing=true
arduboy.upload.use_1200bps_touch=true
arduboy.upload.wait_for_upload_port=true

arduboy.bootloader.tool=arduino:avrdude
arduboy.bootloader.low_fuses=0xff
arduboy.bootloader.high_fuses=0xd0
arduboy.bootloader.extended_fuses=0xcb
arduboy.bootloader.file=caterina/Caterina-Leonardo.hex
arduboy.bootloader.unlock_bits=0x3F
arduboy.bootloader.lock_bits=0x2F

arduboy.build.mcu=atmega32u4
arduboy.build.f_cpu=16000000L
arduboy.build.variant=arduboy
arduboy.build.board=AVR_ARDUBOY
arduboy.build.vid=0x2341
arduboy.build.pid=0x8036
arduboy.build.variant=arduboy
arduboy.build.usb_manufacturer="Arduboy Inc"
arduboy.build.usb_product="Arduboy"
arduboy.build.board=AVR_ARDUBOY
arduboy.build.core=arduino:arduino
arduboy.build.flash_cs=-DCART_CS_SDA
arduboy.build.extra_flags=-DARDUBOY_10 {build.flash_cs} {build.usb_flags}

# Arduboy menu options #########################################################

arduboy.menu.core.arduboy-core=Arduboy optimized core
arduboy.menu.core.arduboy-core.build.core=arduboy

arduboy.menu.core.arduino-core=Standard Arduino core
arduboy.menu.core.arduino-core.build.core=arduino:arduino

