MrBlinky/Arduboy-homemade-package/board-package-source/boards.txt
arduboy.menu.boot.org=original (Caterina)
arduboy.menu.boot.org.upload.maximum_size=28672
arduboy.menu.boot.org.bootloader.high_fuses=0xd0
arduboy.menu.boot.org.bootloader.file=caterina/Caterina-Leonardo.hex
                 
arduboy.menu.boot.cathy3k=Cathy3K (starts with menu)
arduboy.menu.boot.cathy3k.upload.maximum_size=29696
arduboy.menu.boot.cathy3k.bootloader.high_fuses=0xd2
arduboy.menu.boot.cathy3k.bootloader.file=cathy3k/arduboy3k-bootloader-menu-sda.hex

arduboy.menu.boot.cathy3kg=Cathy3K (starts with game)
arduboy.menu.boot.cathy3kg.upload.maximum_size=29696
arduboy.menu.boot.cathy3kg.bootloader.high_fuses=0xd2
arduboy.menu.boot.cathy3kg.bootloader.file=cathy3k/arduboy3k-bootloader-game-sda.hex

################################################################################
# Arduboy DevKit board
################################################################################

arduboy-devkit.name=Arduboy DevKit

#Arduino Leonardo
arduboy-devkit.vid.0=0x2341
arduboy-devkit.pid.0=0x0036
arduboy-devkit.vid.1=0x2341
arduboy-devkit.pid.1=0x8036
arduboy-devkit.vid.2=0x2A03
arduboy-devkit.pid.2=0x0036
arduboy-devkit.vid.3=0x2A03
arduboy-devkit.pid.3=0x8036
#Arduino Micro
arduboy-devkit.vid.4=0x2341
arduboy-devkit.pid.4=0x0037
arduboy-devkit.vid.5=0x2341
arduboy-devkit.pid.5=0x8037
arduboy-devkit.vid.6=0x2A03
arduboy-devkit.pid.6=0x0037
arduboy-devkit.vid.7=0x2A03
arduboy-devkit.pid.7=0x8037
#Genuino Micro
arduboy-devkit.vid.8=0x2341
arduboy-devkit.pid.8=0x8237
#Sparkfun Pro Micro 5V
arduboy-devkit.vid.7=0x1b4f
arduboy-devkit.pid.7=0x9205
arduboy-devkit.vid.8=0x1b4f
arduboy-devkit.pid.8=0x9206

arduboy-devkit.upload.tool=arduino:avrdude
arduboy-devkit.upload.protocol=avr109
arduboy-devkit.upload.maximum_size=28672
arduboy-devkit.upload.maximum_data_size=2560
arduboy-devkit.upload.speed=57600
arduboy-devkit.upload.disable_flushing=true
arduboy-devkit.upload.use_1200bps_touch=true
arduboy-devkit.upload.wait_for_upload_port=true

arduboy-devkit.bootloader.tool=arduino:avrdude
arduboy-devkit.bootloader.low_fuses=0xff
arduboy-devkit.bootloader.high_fuses=0xd0
arduboy-devkit.bootloader.extended_fuses=0xcb
arduboy-devkit.bootloader.file=caterina/Caterina-Leonardo.hex
arduboy-devkit.bootloader.unlock_bits=0x3F
arduboy-devkit.bootloader.lock_bits=0x2F

arduboy-devkit.build.mcu=atmega32u4
arduboy-devkit.build.f_cpu=16000000L
arduboy-devkit.build.variant=arduboy
arduboy-devkit.build.board=AVR_ARDUBOY
arduboy-devkit.build.vid=0x2341
arduboy-devkit.build.pid=0x8036
arduboy-devkit.build.variant=arduboy-devkit
arduboy-devkit.build.usb_manufacturer="Arduboy Inc"
arduboy-devkit.build.usb_product="ABDevKit"
arduboy-devkit.build.board=AVR_ARDUBOY_DEVKIT
arduboy-devkit.build.core=arduino:arduino
arduboy-devkit.build.extra_flags=-DAB_DEVKIT {build.usb_flags}

# DevKit menu options ##########################################################

arduboy-devkit.menu.core.arduboy=Arduboy optimized core
arduboy-devkit.menu.core.arduboy.build.core=arduboy

arduboy-devkit.menu.core.arduino=Standard Arduino core
arduboy-devkit.menu.core.arduino.build.core=arduino:arduino

arduboy-devkit.menu.boot.org=original (Caterina)
arduboy-devkit.menu.boot.org.upload.maximum_size=28672
arduboy-devkit.menu.boot.org.bootloader.high_fuses=0xd0
arduboy-devkit.menu.boot.org.bootloader.file=caterina/Caterina-Leonardo.hex
                 
arduboy-devkit.menu.boot.cathy3k=Cathy3K (starts with menu)
arduboy-devkit.menu.boot.cathy3k.upload.maximum_size=29696
arduboy-devkit.menu.boot.cathy3k.bootloader.high_fuses=0xd2
arduboy-devkit.menu.boot.cathy3k.bootloader.file=cathy3k/arduboy3k-bootloader-menu-devkit.hex

arduboy-devkit.menu.boot.cathy3kg=Cathy3K (starts with game)
arduboy-devkit.menu.boot.cathy3kg.upload.maximum_size=29696
arduboy-devkit.menu.boot.cathy3kg.bootloader.high_fuses=0xd2
arduboy-devkit.menu.boot.cathy3kg.bootloader.file=cathy3k/arduboy3k-bootloader-game-devkit.hex

################################################################################
# 8BitCADE XL board
################################################################################

8bitcadexl.name=8BitCADE XL

#Arduino Leonardo
8bitcadexl.vid.0=0x2341
8bitcadexl.pid.0=0x0036
8bitcadexl.vid.1=0x2341
8bitcadexl.pid.1=0x8036
8bitcadexl.vid.2=0x2A03
8bitcadexl.pid.2=0x0036
8bitcadexl.vid.3=0x2A03
8bitcadexl.pid.3=0x8036

8bitcadexl.upload.tool=arduino:avrdude
8bitcadexl.upload.protocol=avr109
8bitcadexl.upload.maximum_size=29696
8bitcadexl.upload.maximum_data_size=2560
8bitcadexl.upload.speed=57600
8bitcadexl.upload.disable_flushing=true
8bitcadexl.upload.use_1200bps_touch=true
8bitcadexl.upload.wait_for_upload_port=true

8bitcadexl.bootloader.tool=arduino:avrdude
8bitcadexl.bootloader.low_fuses=0xff
8bitcadexl.bootloader.high_fuses=0xd2
8bitcadexl.bootloader.extended_fuses=0xcb
8bitcadexl.bootloader.file=cathy3k/arduboy3k-bootloader-menu-promicro.hex
8bitcadexl.bootloader.unlock_bits=0x3F
8bitcadexl.bootloader.lock_bits=0x2F

8bitcadexl.build.mcu=atmega32u4
8bitcadexl.build.f_cpu=16000000L
8bitcadexl.build.variant=arduboy-promicro-alt
8bitcadexl.build.board=AVR_PROMICRO -DAB_ALTERNATE_WIRING
8bitcadexl.build.vid=0x2341
8bitcadexl.build.pid=0x8036
8bitcadexl.build.usb_manufacturer="8bitCADE"
8bitcadexl.build.usb_product="8bitCADE"
8bitcadexl.build.core=arduino:arduino
8bitcadexl.build.flash_cs=-DCART_CS_RX
8bitcadexl.build.extra_flags=-DARDUBOY_10 -DOLED_SSD1309 {build.flash_cs} {build.contrast} {build.usb_flags}

# 8BitCADE XL menu options #####################################################

#core select

8bitcadexl.menu.core.arduboy-core=Arduboy optimized core
8bitcadexl.menu.core.arduboy-core.build.core=arduboy

8bitcadexl.menu.core.arduino-core=Standard Arduino core
8bitcadexl.menu.core.arduino-core.build.core=arduino:arduino

#bootloader select

8bitcadexl.menu.boot.cathy3k=Cathy3K (starts with menu)
8bitcadexl.menu.boot.cathy3k.upload.maximum_size=29696
8bitcadexl.menu.boot.cathy3k.bootloader.high_fuses=0xd2
8bitcadexl.menu.boot.cathy3k.bootloader.file=cathy3k/arduboy3k-bootloader-menu-promicro.hex

8bitcadexl.menu.boot.cathy3kg=Cathy3K (starts with game)
8bitcadexl.menu.boot.cathy3kg.upload.maximum_size=29696
8bitcadexl.menu.boot.cathy3kg.bootloader.high_fuses=0xd2
8bitcadexl.menu.boot.cathy3kg.bootloader.file=cathy3k/arduboy3k-bootloader-game-promicro.hex

